package kg.geeks.bookcompose.ui.components

data class Novel(
    val id: Int,
    val title: String,
    val writer: String,
    val summary: String,
    val genre: String
)

object LibraryStorage {
    val novels = listOf(
        Novel(201, "Гарри Поттер и философский камень", "Дж. К. Роулинг", "История о мальчике-волшебнике.", "Фэнтези"),
        Novel(202, "Моби Дик", "Герман Мелвилл", "Роман о поиске белого кита.", "Приключения"),
        Novel(203, "Идиот", "Фёдор Достоевский", "Классика русской литературы.", "Классика"),
        Novel(204, "Метро 2033", "Дмитрий Глуховский", "Постапокалиптический роман.", "Фантастика"),
        Novel(205, "Пикник на обочине", "Братья Стругацкие", "Фантастика с философским подтекстом.", "Фантастика")
    )

    val genres = listOf("Все", "Фэнтези", "Приключения", "Классика", "Фантастика")
}